app/controllers/follows_controller.rb

INSERT INTO "follows" ("created_at", "followee_id", "follower_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-08-24 17:43:21.943322"], ["followee_id", 6], ["follower_id", 1], ["updated_at", "2016-08-24 17:43:21.943322"]]
---
  def create
    # artificial latency; yield delay on follow click
    sleep(1)
    @follow = current_user.out_follows.create!(followee_id: params[:user_id])