app/controllers/users_controller.rb

  def show
    if current_user.nil?
      redirect_to new_session_url
      return
    end

    @user = User.includes(tweets: :mentioned_users).find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def search
    if params[:query].present?
      @users = User.where("username ~ ?", params[:query])
---
SELECT "users".* FROM "users"  WHERE (username ~ 'i')